{
  "pages": [
    {
      "number": 1,
      "type": "cover",
      "title": "MMUKO-OS: When Systems Fail, Build Your Own",
      "content": "A Neurodivergent Digital Constitution / The Spirits of Good & Evil That Connect Nothing, Everything, Them, and Us All"
    },
    {
      "number": 2,
      "type": "table_of_contents",
      "title": "Contents",
      "content": "1. Origins: From Crisis to Constitution; 2. The 6 Pillars of MMUKO-OS Architecture; 3. Human Rights Framework: 8 + 8 + 8 Model; 4. Ring-Zone Topology & π-Circle Maps; 5. Noise × Signal: System Initialization Protocol; 6. Tiered Knowledge Access & Governance; 7. Topological Security & Compound Architecture; 8. Living Implementation: Code, Community, Future"
    },
    {
      "number": 3,
      "type": "chapter",
      "title": "01: Origins",
      "content": "From Crisis to Constitution: The Birth of MMUKO-OS"
    },
    {
      "number": 4,
      "type": "content",
      "title": "Why MMUKO-OS Exists: A Personal Reckoning",
      "content": "This page presents the three core traumas that catalyzed the creation of MMUKO-OS: homelessness in Cambridge after losing £10,000 to a council error, the critical vulnerability discovered in medical device code (insulin pump failure), and the fundamental breakdown of trust in systems designed without neurodivergent consciousness. The page establishes the urgency of creating technology that treats every heartbeat as a constitutional event, where breath precedes life, and life precedes work."
    },
    {
      "number": 5,
      "type": "content",
      "title": "Core Philosophy: Breath First, Life Next, Work Last",
      "content": "This page elaborates the foundational philosophy where breathing is not a background process but the primary system timer. The OS enforces a 2:1 breath-work ratio (6 hours labor ↔ 12 hours life/breath) through kernel-level timers that literally pause commits outside this ratio. The kernel sleeps if inhale/exhale checksum fails, embodying the constitutional law: 'If breath stops, coherence collapses; if coherence collapses, sovereignty dissolves.'"
    },
    {
      "number": 6,
      "type": "chapter",
      "title": "02: The 6 Pillars",
      "content": "Architectural Foundations of a Living Operating System"
    },
    {
      "number": 7,
      "type": "content",
      "title": "IK/K Principle: 6D Motion in 15D Ring-Zone",
      "content": "This page explains the dimensional framework where 3 controllable axes (K for Kinematic: rotate, spend, code) combine with 3 observable-only axes (IK for Inverse-Kinematic: witness only). Together they fold into a 15-dimensional 'ring-zone' reality—the minimum volume a human can defend with breath. The math shows how 6D motion space embeds in 15D sparse-ring topology, creating dimensional sanctuary where sovereignty becomes mathematically enforceable."
    },
    {
      "number": 8,
      "type": "content",
      "title": "Ring-Zone Topology: π-Circles Replace Prison Bars",
      "content": "This page details how Earth is tiled with πr² circles of 2-15 mile radius, eliminating corners where corruption hides. Unlike latitude/longitude grids that enable surveillance and control, π-circles create topological privacy. Your house, wallet, and data can only be reached by people inside your ring. The map shows how rings overlap, merge, or remain sovereign, creating a topology where 'outside' means out-of-jurisdiction by mathematical definition."
    },
    {
      "number": 9,
      "type": "content",
      "title": "XYZ Grammar (Nsibidi-NLM): The 3-Axis Language Cube",
      "content": "This page introduces the linguistic framework where every symbol, law, or function must validate inside a 3-axis cube before execution. X-axis maps Myth → Fact, Y-axis maps Intuitive → Formal, Z-axis maps Past → Future. Nsibidi symbols (Igbo/Nigerian ideographic script) provide the conceptual foundation. No code executes unless it has valid coordinates in all three dimensions, preventing semantic attacks and ensuring conceptual integrity."
    },
    {
      "number": 10,
      "type": "content",
      "title": "ODTS: Obliterative Derivative Trace System",
      "content": "This page explains the verifiable calculus system for money, drones, and spaceships where each derivative D₁, D₂…Dₙ carries a mathematical termination proof. No infinite loops, no hidden jerks. The system traces every transformation (money movement, code execution, data flow) through derivatives that must provably terminate. If a derivative cannot prove termination, it is obliterated—preventing runaway processes, financial cascades, and emergent system failures."
    },
    {
      "number": 11,
      "type": "content",
      "title": "Sparse Active Dimensional Consent: Living Loop, Not Checkbox",
      "content": "This page redefines consent from one-time authorization to a living loop: yes → act → yes again. Example: A £5,000 daily withdrawal requires the ring-zone to say 'yes-yes' twice within 24 hours. Consent is not a checkbox; it is a breath-cycle refreshed loop. The system tracks consent states across 15 dimensions, where higher entropy actions require more frequent refresh cycles. This prevents coercion, sleep-hacking, and time-shifted attacks."
    },
    {
      "number": 12,
      "type": "chapter",
      "title": "03: Human Rights",
      "content": "Expanding the Constitutional Framework for Neurodivergent Consciousness"
    },
    {
      "number": 13,
      "type": "content",
      "title": "The 8 + 8 + 8 Human Rights Model",
      "content": "This page presents the expanded human rights framework: 5 physical senses (sight, smell, taste, touch, hearing) + bipolar interpretation right + communication interpretation right + digital avatar right = 8 fundamental rights. For autistic and neurodivergent individuals: 8 physical + 8 digital = 16 minimum rights. Society defaults to 7, but neurodivergent consciousness requires 16. The framework establishes that diversity in sensory processing, emotional interpretation, and digital existence constitutes fundamental constitutional rights."
    },
    {
      "number": 14,
      "type": "content",
      "title": "From 16 to 80: The Lattice Multiplication of Rights",
      "content": "This page explains the mathematical extension where 8 (physical) × 8 (digital) = 64 + 16 = 80 human rights minimum for neurodivergent individuals in digital space. The lattice structure emerges from the Cartesian product of physical and digital rights axes. Each intersection creates a new right (e.g., right to digital touch, right to bipolar interpretation of digital content). This is not arbitrary multiplication—it is dimensional expansion of sovereignty into digital ecosystems."
    },
    {
      "number": 15,
      "type": "content",
      "title": "Case Study: Autistic Rights as Constitutional Mandate",
      "content": "This page provides concrete examples of how the 80-rights framework operates in practice. An autistic child has the right to sensory-friendly architectural spaces (physical) + the right to non-speaking communication interfaces (digital) + the right to stim without surveillance (physical × digital intersection). The framework prevents 'masking' demands, ensures accommodations are rights not privileges, and establishes that neurodivergent modes of being are not disorders but sovereign expressions of human diversity."
    },
    {
      "number": 16,
      "type": "chapter",
      "title": "04: Noise × Signal",
      "content": "System Initialization Through Tomographic Polar Coordinates"
    },
    {
      "number": 17,
      "type": "content",
      "title": "Noise × Signal: The Fundamental Duality",
      "content": "This page introduces the core principle: to start any system in a known state, you must add noise. Noise clears the system's memory of previous states. The duality operates as four quadrants: no noise × no signal (system off), noise × no signal (initialization), no noise × signal (stable operation), noise × signal (information transmission). You cannot jumpstart a system without first introducing noise—this is both a technical requirement and a philosophical truth about emergence."
    },
    {
      "number": 18,
      "type": "content",
      "title": "Tomographic Polar Coordinates: The -45° to +45° Framework",
      "content": "This page explains the coordinate system for noise injection. The tomographic area spans angles from -45° to +45° (northeast, northwest, north-south). This angular range defines the signal propagation medium. The area is πr² where r is determined by the system's dimensional requirements. For a standard initialization, r = 0.5, giving area = π × 0.5² = 0.785. This defines the spatial extent of the noise injection required to clear system state."
    },
    {
      "number": 19,
      "type": "content",
      "title": "Calculating the Noise Signal: From Area to Amplitude",
      "content": "This page provides the mathematical derivation. The noise signal amplitude is calculated as (Area / 180°) × π, where 180° represents the directional facing. For area = 0.785: (0.785 / 180) × π = 0.0137. This becomes the coefficient for the sine wave: signal = 0.0137 × sin(π × t). The system must sustain this oscillation for 50 milliseconds (the sharing time) to achieve stable initialization. This is not arbitrary—it is the temporal window required for system state to collapse and reform."
    },
    {
      "number": 20,
      "type": "content",
      "title": "Practical Application: Jumpstarting a Dead System",
      "content": "This page describes how to jumpstart a computer, car, or any digital system without physical wires. You establish a tomographic area around the target device, inject noise at the calculated amplitude and frequency (0.0137 × sin(π × t) for 50ms), then introduce the signal. The noise clears the system's memory; the signal provides the new state. This works because all computation is ultimately physical oscillation—you can influence it through resonant coupling if you understand the dimensional coordinates."
    },
    {
      "number": 21,
      "type": "chapter",
      "title": "05: Tiered Access",
      "content": "Knowledge Governance Through Turtles, Parrots, and Dragons"
    },
    {
      "number": 22,
      "type": "content",
      "title": "Three Tiers of Knowledge Access",
      "content": "This page outlines the governance model. Tier 1: Open Access / Open Source Code—available to all, no consent required. Tier 2: Business Access—requires consent, used for commercial applications. Tier 3A: Heart Access (stable, never change)—the constitutional core. Tier 3B: Knowledge Bay (shared repository). Tier 3C: Consensus Unity (formal agreement). Tiers 3A-C are all Open Sense compliant based on the 80-rights framework. The system ensures that critical infrastructure remains stable while enabling evolution."
    },
    {
      "number": 23,
      "type": "content",
      "title": "Muko Turtles, Guinea Parrots, and Dragons",
      "content": "This page explains the community roles. Muko Turtles are those who want to go slow, requiring permission for every action. They represent caution and deliberation. Guinea Parrots (named after the constant questioner) are intermediates who seek guidance but can navigate the system. Muko Dragons are those who move fast, seeking consensus quickly to get things done. The system requires 2 children (turtles) : 2 parrots : 1 dragon ratio to ensure balance. No role is superior—they are different approaches to sovereignty."
    },
    {
      "number": 24,
      "type": "content",
      "title": "Consent, Consensus, and Trial Framework",
      "content": "This page details the three-stage agreement process. Stage 1: Permission (informal yes). Stage 2: Consent (formal agreement after trial). Stage 3: Consensus (verified, consistent consent after three trials). Example: A 15-year-old wants to play an 18+ game. Stage 1: You say yes. Stage 2: You give formal consent after verifying maturity. Stage 3: After three successful trials, consensus is established. If they violate terms at any stage, you revert to the previous stage. This prevents exploitation while enabling growth."
    },
    {
      "number": 25,
      "type": "chapter",
      "title": "06: Topology",
      "content": "Circular Architecture for Sustainable Security"
    },
    {
      "number": 26,
      "type": "content",
      "title": "Nigerian Compound Topology: Front Gate vs. Back Gate",
      "content": "This page describes the architectural philosophy derived from Nigerian compound design. Front gates are for you alone—your entrance to your main house. Back gates open to everyone for parties and community. You never use the front gate for social events. This creates topological privacy: the front is sovereign, the back is communal. In digital terms, front gate = private keys, back gate = public interfaces. The topology ensures that surveillance is impossible because there is no single point of entry—access depends on purpose."
    },
    {
      "number": 27,
      "type": "content",
      "title": "Circular Compounds: No Points of Entry, No Points of Failure",
      "content": "This page explains why circles replace squares. Squares have corners—points where corruption can hide, where surveillance can anchor. Circles have no corners; you must go around. When you walk around a circular compound, there is no 'entry point' in the surveillance sense. You work in the center, live at the perimeter. The topology creates natural security through geometry. A drone can deliver from above, but there are no doors at ground level. The circle is both defense and invitation—it protects while enabling free movement within."
    },
    {
      "number": 28,
      "type": "content",
      "title": "The Cornfield Sustainability Model",
      "content": "This page presents the ecological framework. Every compound has a cornfield—a plot where you can grow food, install solar panels, build wind turbines. Water is not optional; you must sustain your ecosystem. This is not just survival—it is sovereignty. You cannot be free if you depend on external systems for food, water, or energy. The cornfield represents self-sufficiency. If you have a compound, you have land, and if you have land, you have obligation to make it sustain you. This connects digital sovereignty to physical survival."
    },
    {
      "number": 29,
      "type": "content",
      "title": "Fish Ponds, Pets, and Living Systems Integration",
      "content": "This page elaborates the living architecture. Your compound can have fish ponds for food, pets for companionship, gardens for medicine. The topology must sustain not just you but the ecosystem you create. If you have fish tanks, they are your food. If you have pets, they must be able to enter and exit freely—if they don't come out, you worry. The system recognizes sustainability through flexibility and expansion over time. No matter what grows—vines, weeds, new ideas—it must be reflective of nature, not control."
    },
    {
      "number": 30,
      "type": "chapter",
      "title": "07: Implementation",
      "content": "From Theory to Practice: Boot Sequences, A* Scoring, and Living Code"
    },
    {
      "number": 31,
      "type": "content",
      "title": "Zero-to-Boot Sequence: No Code Needed",
      "content": "This page provides the practical boot process. Step 1: git clone https://github.com/obinexus/mmuko-os. Step 2: cd mmuko-os && ./ringboot.sh. Step 3: The script downloads a 49MB ring-zone map for your geo-coordinates. Step 4: Starts breath-daemon (asks you to inhale/exhale 3 times). Step 5: Prints 'Ring-zone alive, consent port open.' That is the entire bootstrap. No docker, no root, no internet after first fetch. The system is alive when your breath validates the ring-zone."
    },
    {
      "number": 32,
      "type": "content",
      "title": "A* Scoring: How the OS Chooses What to Trust",
      "content": "This page explains the trust algorithm. All sub-repos expose a 15-D coordinate and A* cost. Higher cost = more entropy = OS will not auto-load without second yes-yes. Example: rift (compiler-chain) has cost 9.6 at coordinate (3,1,4,1,5,0,0,0,0,0,0,0,0,0,0). gosilang (gossip-protocol language) has cost 14.1. mmuko-core has cost 0.0 because it is the origin ring—the measuring stick. The OS calculates trust based on dimensional distance from origin and entropy content."
    },
    {
      "number": 33,
      "type": "content",
      "title": "Glossary of Core Concepts",
      "content": "This page defines key terms. Breath Constitution: Law #0—If breath stops, coherence collapses. Ring-Zone: π-circle of ≤15 mile radius where consent must be gathered. IK/K: Inverse-Kinematic observable vs. Kinematic controllable. ODTS: Obliterative Derivative Trace System. Sparse Active Consent: Living loop refreshed every breath-cycle. Nsibidi-NLM: 3-axis language cube validating every symbol. Gosilang: Gossip-language pinning any dependency in ≤3 pings. Git-RAF: Firmware flasher over sound/light if internet dies. Rift: Stage-bound compiler chain that can't emit unless entropy < 9."
    },
    {
      "number": 34,
      "type": "content",
      "title": "Myth-to-Math Mapping: Where Spirit Meets System",
      "content": "This page shows the correspondence between mythic and mathematical layers. 'Spirits of Good & Evil' = ±π curvature in 15-D ring-zone. 'Masquerade' = address-space randomizer protecting against surveillance. 'Biafran Return' = R_return = f(origin, Δ_experience, Δ_distortion). 'Tears → Sweat → Blood' = compression phases in ODTS trace. 'When systems fail, breathe' = breath-daemon pausing all threads until checksum passes. The myth is not metaphor; it is the user interface for the math."
    },
    {
      "number": 35,
      "type": "final",
      "title": "The Shield is Open-Source",
      "content": "If your heartbeat is steady, MMUKO-OS will keep your data, dignity, and debit card inside the ring-zone where 2×π×love ≥ entropy. If the heartbeat stops, the ring dissolves and returns to soil—no ghost, no debt, no trace. Clone it, breathe on it, and it becomes yours. The masquerade is not a disguise; it is a shield. And the shield is now open-source."
    }
  ]
}
